{
  "<BOS>": 0,
  "<EOS>": 1,
  "<PARA>": 2,
  "<UNK>": 3,
  "!": 4,
  "\"": 5,
  "'": 6,
  "(": 7,
  ")": 8,
  "*": 9,
  ",": 10,
  "-": 11,
  ".": 12,
  "/": 13,
  "1": 14,
  "102": 15,
  "1070": 16,
  "111": 17,
  "1147": 18,
  "1158": 19,
  "130": 20,
  "1311": 21,
  "1341": 22,
  "1342": 23,
  "1401": 24,
  "1403": 25,
  "1417": 26,
  "1418": 27,
  "1419": 28,
  "1420": 29,
  "1421": 30,
  "1462": 31,
  "1592": 32,
  "172": 33,
  "1914": 34,
  "1918": 35,
  "1937": 36,
  "1939": 37,
  "1944": 38,
  "1_": 39,
  "20th": 40,
  "22nd": 41,
  "3": 42,
  "33": 43,
  "37": 44,
  "4": 45,
  "5": 46,
  "60": 47,
  "64": 48,
  "80": 49,
  ":": 50,
  ";": 51,
  "=": 52,
  "?": 53,
  "A": 54,
  "ADELARD": 55,
  "ADMITTANCE": 56,
  "AII": 57,
  "AND": 58,
  "ANGELICA": 59,
  "ANNOUNCEMENT_": 60,
  "AWAKE": 61,
  "About": 62,
  "Above": 63,
  "Absurdly": 64,
  "Accident": 65,
  "According": 66,
  "Accursed": 67,
  "Ach": 68,
  "Across": 69,
  "Actually": 70,
  "Adamant": 71,
  "Adelard": 72,
  "Adventure": 73,
  "Afar": 74,
  "Afore": 75,
  "Africa": 76,
  "After": 77,
  "Again": 78,
  "Against": 79,
  "Age": 80,
  "Aglar": 81,
  "Aglarond": 82,
  "Ah": 83,
  "Ahead": 84,
  "Ai": 85,
  "Aid": 86,
  "Aiglos": 87,
  "Alas": 88,
  "Aldalómë": 89,
  "Aldor": 90,
  "Alive": 91,
  "All": 92,
  "Alliance": 93,
  "Allow": 94,
  "Almost": 95,
  "Alone": 96,
  "Along": 97,
  "Already": 98,
  "Also": 99,
  "Altogether": 100,
  "Always": 101,
  "Am": 102,
  "Ambar": 103,
  "Ambaróna": 104,
  "Amid": 105,
  "Amidst": 106,
  "Amon": 107,
  "Among": 108,
  "Amroth": 109,
  "An": 110,
  "Anborn": 111,
  "Ancalagon": 112,
  "Ancalima": 113,
  "Ancient": 114,
  "And": 115,
  "Andave": 116,
  "Andros": 117,
  "Anduin": 118,
  "Andy": 119,
  "Andúnë": 120,
  "Andúril": 121,
  "Anfalas": 122,
  "Angband": 123,
  "Angbor": 124,
  "Angle": 125,
  "Angmar": 126,
  "Angren": 127,
  "Angrenost": 128,
  "Annon": 129,
  "Annúminas": 130,
  "Annûn": 131,
  "Anor": 132,
  "Another": 133,
  "Answer": 134,
  "Anxiety": 135,
  "Anxiously": 136,
  "Any": 137,
  "Anyhow": 138,
  "Anyone": 139,
  "Anything": 140,
  "Anyway": 141,
  "Anárion": 142,
  "Anórien": 143,
  "Ape": 144,
  "Apparently": 145,
  "Apple": 146,
  "Appledore": 147,
  "Apples": 148,
  "Appoint": 149,
  "April": 150,
  "Ar": 151,
  "Aragorn": 152,
  "Aragorn_": 153,
  "Arathorn": 154,
  "Araw": 155,
  "Archet": 156,
  "Are": 157,
  "Aren": 158,
  "Argonath": 159,
  "Arise": 160,
  "Armed": 161,
  "Armies": 162,
  "Arnach": 163,
  "Arnen": 164,
  "Arnor": 165,
  "Arod": 166,
  "Arose": 167,
  "Arrow": 168,
  "Arrows": 169,
  "Arvedui": 170,
  "Arvernien": 171,
  "Arwen": 172,
  "Arwen_": 173,
  "As": 174,
  "Asfaloth": 175,
  "Ash": 176,
  "Ashamed": 177,
  "Ashen": 178,
  "Ashes": 179,
  "Ask": 180,
  "Ass": 181,
  "Assaulting": 182,
  "Assuredly": 183,
  "At": 184,
  "Authorities": 185,
  "Authority": 186,
  "Autumn": 187,
  "Await": 188,
  "Awaited": 189,
  "Awake": 190,
  "Away": 191,
  "Awe": 192,
  "Axe_": 193,
  "Aye": 194,
  "Azanulbizar": 195,
  "B": 196,
  "BAG": 197,
  "BAGGINS": 198,
  "BALIN": 199,
  "BARLIMAN": 200,
  "BOTH": 201,
  "BRACEGIRDLE": 202,
  "BREE": 203,
  "BURROWS": 204,
  "BUSINESS": 205,
  "BUTTERBUR": 206,
  "BYE": 207,
  "Back": 208,
  "Backward": 209,
  "Bad": 210,
  "Bag": 211,
  "Baggins": 212,
  "Bagginses": 213,
  "Bagshot": 214,
  "Bain": 215,
  "Baldor": 216,
  "Balin": 217,
  "Balrog": 218,
  "Bamfurlong": 219,
  "Bandobras": 220,
  "Bane": 221,
  "Bane_": 222,
  "Banks": 223,
  "Banquets": 224,
  "Barad": 225,
  "Barahir": 226,
  "Baran": 227,
  "Baranduin": 228,
  "Baranor": 229,
  "Baraz": 230,
  "Barazinbar": 231,
  "Bard": 232,
  "Bardings": 233,
  "Bare": 234,
  "Barely": 235,
  "Barley": 236,
  "Barliman": 237,
  "Barrow": 238,
  "Barrowfield": 239,
  "Barrows": 240,
  "Baruk": 241,
  "Base": 242,
  "Bathe": 243,
  "Battle": 244,
  "Bay": 245,
  "Be": 246,
  "Beacon": 247,
  "Bear": 248,
  "Bearer": 249,
  "Beautiful": 250,
  "Beaver": 251,
  "Because": 252,
  "Beds": 253,
  "Beechbone": 254,
  "Beer": 255,
  "Before": 256,
  "Began": 257,
  "Begging": 258,
  "Begone": 259,
  "Behind": 260,
  "Behold": 261,
  "Being": 262,
  "Beleriand": 263,
  "Belfalas": 264,
  "Believe": 265,
  "Belike": 266,
  "Bells": 267,
  "Below": 268,
  "Ben": 269,
  "Bend": 270,
  "Beneath": 271,
  "Beorn": 272,
  "Beornings": 273,
  "Beregond": 274,
  "Beren": 275,
  "Bergil": 276,
  "Berhael": 277,
  "Berúthiel": 278,
  "Beside": 279,
  "Besides": 280,
  "Better": 281,
  "Between": 282,
  "Beware": 283,
  "Beyond": 284,
  "Bid": 285,
  "Bifur": 286,
  "Big": 287,
  "Biggest": 288,
  "Bilbo": 289,
  "Bilbo_": 290,
  "Bill": 291,
  "Bind": 292,
  "Bird": 293,
  "Birds": 294,
  "Birthday": 295,
  "Biting": 296,
  "Black": 297,
  "Blackness": 298,
  "Blackroot": 299,
  "Blade": 300,
  "Blanco": 301,
  "Blasts": 302,
  "Bless": 303,
  "Blessed": 304,
  "Blindfold": 305,
  "Blood": 306,
  "Blossom": 307,
  "Blue": 308,
  "Boats": 309,
  "Bob": 310,
  "Boffin": 311,
  "Boffins": 312,
  "Bofur": 313,
  "Bold": 314,
  "Bolger": 315,
  "Bolgers": 316,
  "Bom": 317,
  "Bombadil": 318,
  "Bombadillo": 319,
  "Bombur": 320,
  "Boner": 321,
  "Bonfire": 322,
  "Book": 323,
  "Books": 324,
  "Boom": 325,
  "Borgil": 326,
  "Borne": 327,
  "Boro": 328,
  "Boromir": 329,
  "Boromir_you": 330,
  "Boss": 331,
  "Bosses": 332,
  "Both": 333,
  "Bound": 334,
  "Bounders": 335,
  "Bowman": 336,
  "Boys": 337,
  "Bracegirdle": 338,
  "Bracegirdles": 339,
  "Brambles": 340,
  "Branched": 341,
  "Brand": 342,
  "Brandir": 343,
  "Brandy": 344,
  "Brandybuck": 345,
  "Brandybucks": 346,
  "Brandywine": 347,
  "Brave": 348,
  "Brazen": 349,
  "Breakfast": 350,
  "Breaking": 351,
  "Breath": 352,
  "Breathe": 353,
  "Bree": 354,
  "Bree_": 355,
  "Breeland": 356,
  "Breelanders": 357,
  "Bregalad": 358,
  "Brego": 359,
  "Bribing": 360,
  "Bridge": 361,
  "Bridgefields": 362,
  "Brief": 363,
  "Briefly": 364,
  "Bright": 365,
  "Bring": 366,
  "Bringing": 367,
  "Brm": 368,
  "Brockenbores": 369,
  "Brockhouse": 370,
  "Brockhouses": 371,
  "Broke": 372,
  "Broken": 373,
  "Brown": 374,
  "Brr": 375,
  "Bruinen": 376,
  "Buck": 377,
  "Buckland": 378,
  "Bucklander": 379,
  "Bucklanders": 380,
  "Bucklebury": 381,
  "Buckler": 382,
  "Budgeford": 383,
  "Buds": 384,
  "Bullroarer": 385,
  "Bumpkin": 386,
  "Bundushathûr": 387,
  "Burden": 388,
  "Burg": 389,
  "Buried": 390,
  "Burn": 391,
  "Burrows": 392,
  "Burrowses": 393,
  "Bush_": 394,
  "Business": 395,
  "Busy": 396,
  "But": 397,
  "Butterbur": 398,
  "By": 399,
  "Bywater": 400,
  "Cair": 401,
  "Calacirian": 402,
  "Calacirya": 403,
  "Calaciryo": 404,
  "Calembel": 405,
  "Calenardhon": 406,
  "Calenhad": 407,
  "Call": 408,
  "Called": 409,
  "Calling": 410,
  "Came": 411,
  "Can": 412,
  "Candles": 413,
  "Cannot": 414,
  "Captain": 415,
  "Captains": 416,
  "Carach": 417,
  "Caradhras": 418,
  "Caras": 419,
  "Carchost": 420,
  "Care": 421,
  "Careful": 422,
  "Carefully": 423,
  "Carn": 424,
  "Carnimírië": 425,
  "Carried": 426,
  "Carrion": 427,
  "Carrock": 428,
  "Cast": 429,
  "Casting": 430,
  "Caught": 431,
  "Causeway": 432,
  "Cautious": 433,
  "Cautiously": 434,
  "Caverns": 435,
  "Caves": 436,
  "Caveyard": 437,
  "Celebdil": 438,
  "Celeborn": 439,
  "Celebrant": 440,
  "Celebrimbor": 441,
  "Celebrían": 442,
  "Celerdain": 443,
  "Celos": 444,
  "Ceorl": 445,
  "Cerin": 446,
  "Certainly": 447,
  "Chamber": 448,
  "Chambers": 449,
  "Change": 450,
  "Changes": 451,
  "Chapter": 452,
  "Charging": 453,
  "Checking": 454,
  "Cheers": 455,
  "Chetwood": 456,
  "Chief": 457,
  "Childless": 458,
  "Choices": 459,
  "Choose": 460,
  "Christopher": 461,
  "Chubb": 462,
  "Chubbs": 463,
  "Cirdan": 464,
  "Ciril": 465,
  "Cirion": 466,
  "Cirith": 467,
  "Citadel": 468,
  "City": 469,
  "Clambering": 470,
  "Clang": 471,
  "Clear": 472,
  "Clearer": 473,
  "Clearly": 474,
  "Cleft": 475,
  "Clever": 476,
  "Climb": 477,
  "Cling": 478,
  "Close": 479,
  "Closed": 480,
  "Closer": 481,
  "Clothes": 482,
  "Cloudyhead": 483,
  "Cobwebs": 484,
  "Cock": 485,
  "Cold": 486,
  "Collect": 487,
  "Colours": 488,
  "Combe": 489,
  "Come": 490,
  "Comes": 491,
  "Comfort": 492,
  "Coming": 493,
  "Command": 494,
  "Common": 495,
  "Companies": 496,
  "Companions": 497,
  "Company": 498,
  "Concealment": 499,
  "Concerning": 500,
  "Condor": 501,
  "Conin": 502,
  "Consider": 503,
  "Conspiracy": 504,
  "Coomb": 505,
  "Cormacolindor": 506,
  "Cormallen": 507,
  "Corsairs": 508,
  "Cotton": 509,
  "Cottons": 510,
  "Could": 511,
  "Couldn": 512,
  "Council": 513,
  "Counsel": 514,
  "Counsels": 515,
  "Country": 516,
  "Courage": 517,
  "Court": 518,
  "Cousin": 519,
  "Covered": 520,
  "Cowering": 521,
  "Crack": 522,
  "Cracks": 523,
  "Crawling": 524,
  "Crazy": 525,
  "Creatures": 526,
  "Creeping": 527,
  "Crickhollow": 528,
  "Cries": 529,
  "Cross": 530,
  "Crouched": 531,
  "Crouching": 532,
  "Crown": 533,
  "Cruel": 534,
  "Crush": 535,
  "Crying": 536,
  "Cuio": 537,
  "Cunning": 538,
  "Curiosity": 539,
  "Curse": 540,
  "Curses": 541,
  "Curtain": 542,
  "Curtains": 543,
  "Curunír": 544,
  "Cut": 545,
  "Círdan": 546,
  "D": 547,
  "DALE": 548,
  "DORA": 549,
  "DOWNFALL": 550,
  "Dad": 551,
  "Daddy": 552,
  "Daeron": 553,
  "Dagorlad": 554,
  "Dale": 555,
  "Dales": 556,
  "Damrod": 557,
  "Danger": 558,
  "Dangerous": 559,
  "Dare": 560,
  "Dark": 561,
  "Darker": 562,
  "Darkness": 563,
  "Darn": 564,
  "Dashing": 565,
  "Daur": 566,
  "Dawn": 567,
  "Day": 568,
  "Days": 569,
  "Dazed": 570,
  "Dead": 571,
  "Dead_": 572,
  "Deadmen": 573,
  "Deafening": 574,
  "Deal": 575,
  "Dear": 576,
  "Dearth": 577,
  "Death": 578,
  "Debate": 579,
  "December": 580,
  "Deep": 581,
  "Deep_": 582,
  "Deeping": 583,
  "Delay": 584,
  "Delving": 585,
  "Denethor": 586,
  "Depart": 587,
  "Departure": 588,
  "Deputy": 589,
  "Derndingle": 590,
  "Dernhelm": 591,
  "Derufin": 592,
  "Dervorin": 593,
  "Deserting": 594,
  "Deserves": 595,
  "Desolation": 596,
  "Despair": 597,
  "Desperate": 598,
  "Desperately": 599,
  "Despite": 600,
  "Destroy": 601,
  "Devilry": 602,
  "Diary": 603,
  "Did": 604,
  "Didn": 605,
  "Didst": 606,
  "Die": 607,
  "Dig": 608,
  "Dike": 609,
  "Dimholt": 610,
  "Dimly": 611,
  "Dimrill": 612,
  "Dior": 613,
  "Dire": 614,
  "Dirty": 615,
  "Disappearance": 616,
  "Dismayed": 617,
  "Distant": 618,
  "Disturbed": 619,
  "Dividing": 620,
  "Diving": 621,
  "Dizzy": 622,
  "Dn": 623,
  "Do": 624,
  "Does": 625,
  "Doesn": 626,
  "Dol": 627,
  "Dome": 628,
  "Dominion": 629,
  "Don": 630,
  "Done": 631,
  "Doner": 632,
  "Doom": 633,
  "Door": 634,
  "Doors": 635,
  "Doorward": 636,
  "Dora": 637,
  "Dori": 638,
  "Doriath": 639,
  "Dorthonion": 640,
  "Dotard": 641,
  "Double": 642,
  "Doubly": 643,
  "Doubt": 644,
  "Doubtless": 645,
  "Down": 646,
  "Downlands": 647,
  "Downs": 648,
  "Dragged": 649,
  "Dragon": 650,
  "Dragon_": 651,
  "Dragons": 652,
  "Draw": 653,
  "Drawing": 654,
  "Drawn": 655,
  "Dread": 656,
  "Dreadful": 657,
  "Dream": 658,
  "Dreamflower": 659,
  "Dreamlike": 660,
  "Dreams": 661,
  "Dressed": 662,
  "Drink": 663,
  "Drink_": 664,
  "Drive": 665,
  "Driven": 666,
  "Drogo": 667,
  "Dropping": 668,
  "Drownded": 669,
  "Drowns": 670,
  "Drums": 671,
  "Dry": 672,
  "Drúadan": 673,
  "Due": 674,
  "Duilin": 675,
  "Duinhir": 676,
  "Dull": 677,
  "Dunharrow": 678,
  "Dunland": 679,
  "Dunlendings": 680,
  "Durin": 681,
  "During": 682,
  "Durthang": 683,
  "Dusk": 684,
  "Dusst": 685,
  "Dust": 686,
  "Dwalin": 687,
  "Dwarf": 688,
  "Dwarrowdelf": 689,
  "Dwarves": 690,
  "Dwimorberg": 691,
  "Dwimordene": 692,
  "Dáin": 693,
  "Déagol": 694,
  "Déor": 695,
  "Déorwine": 696,
  "Dínen": 697,
  "Dîn": 698,
  "Dúath": 699,
  "Dúnadan": 700,
  "Dúnedain": 701,
  "Dúnhere": 702,
  "Dûm": 703,
  "END": 704,
  "ENT": 705,
  "ENTWIFE": 706,
  "EXCEPT": 707,
  "Each": 708,
  "Eagle": 709,
  "Eagles": 710,
  "Early": 711,
  "Earth": 712,
  "Easier": 713,
  "East": 714,
  "Eastemnet": 715,
  "Easterling": 716,
  "Easterlings": 717,
  "Eastfarthing": 718,
  "Eastfold": 719,
  "Eastlands": 720,
  "Eastward": 721,
  "Easy": 722,
  "Eat": 723,
  "Eaten": 724,
  "Eavesdropping": 725,
  "Echoes": 726,
  "Echor": 727,
  "Ecthelion": 728,
  "Edain": 729,
  "Edoras": 730,
  "Egladil": 731,
  "Eglerio": 732,
  "Eh": 733,
  "Eight": 734,
  "Eilenach": 735,
  "Either": 736,
  "Elanor": 737,
  "Elbereth": 738,
  "Elbereth_": 739,
  "Eldamar": 740,
  "Eldar": 741,
  "Elder": 742,
  "Eldest": 743,
  "Elen": 744,
  "Elendil": 745,
  "Elenion": 746,
  "Elentári": 747,
  "Elessar": 748,
  "Elessar_": 749,
  "Elf": 750,
  "Elfhelm": 751,
  "Elfstone": 752,
  "Elladan": 753,
  "Elrohir": 754,
  "Elrond": 755,
  "Elven": 756,
  "Elvendom": 757,
  "Elvenhome": 758,
  "Elves": 759,
  "Elvish": 760,
  "Elwing": 761,
  "Emyn": 762,
  "Enchantment": 763,
  "Encircling": 764,
  "End": 765,
  "Endless": 766,
  "Endorenna": 767,
  "Enemies": 768,
  "Enemy": 769,
  "England": 770,
  "Enjoying": 771,
  "Enormous": 772,
  "Enough": 773,
  "Ent": 774,
  "Enter": 775,
  "Enting": 776,
  "Entings": 777,
  "Entish": 778,
  "Entmaiden": 779,
  "Entmaidens": 780,
  "Entmoot": 781,
  "Ents": 782,
  "Entwade": 783,
  "Entwash": 784,
  "Entwives": 785,
  "Entwood": 786,
  "Eorl": 787,
  "Eorlingas": 788,
  "Ephel": 789,
  "Er": 790,
  "Erain": 791,
  "Ere": 792,
  "Erebor": 793,
  "Erech": 794,
  "Ered": 795,
  "Eregion": 796,
  "Erelas": 797,
  "Eressëa": 798,
  "Erestor": 799,
  "Eriador": 800,
  "Erkenbrand": 801,
  "Erui": 802,
  "Escaped": 803,
  "Esgalduin": 804,
  "Esgaroth": 805,
  "Esmeralda": 806,
  "Especially": 807,
  "Ethir": 808,
  "Ettendales": 809,
  "Ettenmoors": 810,
  "Eve": 811,
  "Even": 812,
  "Evendim": 813,
  "Evening": 814,
  "Evenstar": 815,
  "Eventually": 816,
  "Ever": 817,
  "Everard": 818,
  "Evereven": 819,
  "Evermind": 820,
  "Evernight": 821,
  "Everwhite": 822,
  "Every": 823,
  "Everyone": 824,
  "Everything": 825,
  "Everywhere": 826,
  "Evidently": 827,
  "Evil": 828,
  "Exactly": 829,
  "Excellent": 830,
  "Except": 831,
  "Excitement": 832,
  "Excuse": 833,
  "Exiles": 834,
  "Expect": 835,
  "Eye": 836,
  "Eyes": 837,
  "Eärello": 838,
  "Eärendil": 839,
  "Eärnur": 840,
  "F": 841,
  "FEAR": 842,
  "FIRE": 843,
  "FOES": 844,
  "FRODO": 845,
  "FUNDIN": 846,
  "Face": 847,
  "Faces": 848,
  "Faint": 849,
  "Fair": 850,
  "Fairbairns": 851,
  "Fairs": 852,
  "Faithful": 853,
  "Faithless": 854,
  "Fall": 855,
  "Fallen": 856,
  "Fallohide": 857,
  "Fallohides": 858,
  "Fallohidish": 859,
  "Falls": 860,
  "False": 861,
  "Families": 862,
  "Fancy": 863,
  "Fang": 864,
  "Fangorn": 865,
  "Fanuidhol": 866,
  "Fanuilos": 867,
  "Far": 868,
  "Faramir": 869,
  "Fare": 870,
  "Farewell": 871,
  "Farmer": 872,
  "Farthing": 873,
  "Farthings": 874,
  "Fast": 875,
  "Fastred": 876,
  "Fat": 877,
  "Fate": 878,
  "Fathers": 879,
  "Fatty": 880,
  "Fealty": 881,
  "Fear": 882,
  "Fearfully": 883,
  "Fearing": 884,
  "Fearless": 885,
  "Feast": 886,
  "Feasts": 887,
  "Feel": 888,
  "Feeling": 889,
  "Feet": 890,
  "Felaróf": 891,
  "Fell": 892,
  "Fellowship": 893,
  "Fen": 894,
  "Fences": 895,
  "Fengel": 896,
  "Fenmarch": 897,
  "Fennas": 898,
  "Ferny": 899,
  "Ferry": 900,
  "Few": 901,
  "Fewer": 902,
  "Fey": 903,
  "Fiddlesticks": 904,
  "Field": 905,
  "Fields": 906,
  "Fierce": 907,
  "Fiery": 908,
  "Fifteen": 909,
  "Fight": 910,
  "Fighting": 911,
  "Figures": 912,
  "File": 913,
  "Fill": 914,
  "Filled": 915,
  "Fimbrethil": 916,
  "Finally": 917,
  "Find": 918,
  "Findegil": 919,
  "Finduilas": 920,
  "Fine": 921,
  "Fingers": 922,
  "Finglas": 923,
  "Finish": 924,
  "Finrod": 925,
  "Fire": 926,
  "Firefoot": 927,
  "Firelight": 928,
  "Fires": 929,
  "Firienfeld": 930,
  "Firienwood": 931,
  "First": 932,
  "Firstborn": 933,
  "Fish": 934,
  "Fisher": 935,
  "Fissh": 936,
  "Five": 937,
  "Fladrif": 938,
  "Flame": 939,
  "Flaming": 940,
  "Flammifer": 941,
  "Flapping": 942,
  "Flats": 943,
  "Flee": 944,
  "Flies": 945,
  "Flight": 946,
  "Fling": 947,
  "Flinging": 948,
  "Floating": 949,
  "Flocks": 950,
  "Flotsam": 951,
  "Flourdumpling": 952,
  "Fly": 953,
  "Flói": 954,
  "Foaming": 955,
  "Foes": 956,
  "Fog": 957,
  "Foiled": 958,
  "Folca": 959,
  "Folco": 960,
  "Folcwine": 961,
  "Folde": 962,
  "Folk": 963,
  "Follow": 964,
  "Following": 965,
  "Folly": 966,
  "Fond": 967,
  "Food": 968,
  "Fool": 969,
  "Foolish": 970,
  "Foolishly": 971,
  "Foolishness": 972,
  "Fools": 973,
  "Foot": 974,
  "Footpads": 975,
  "Footsteps": 976,
  "For": 977,
  "Forbidden": 978,
  "Forcing": 979,
  "Ford": 980,
  "Fords": 981,
  "Foremost": 982,
  "Forest": 983,
  "Forests": 984,
  "Forget": 985,
  "Forgive": 986,
  "Forgoil": 987,
  "Forlong": 988,
  "Forn": 989,
  "Fornost": 990,
  "Forth": 991,
  "Fortress": 992,
  "Forts": 993,
  "Fortunately": 994,
  "Forty": 995,
  "Forward": 996,
  "Foul": 997,
  "Found": 998,
  "Fountain": 999,
  "Four": 1000,
  "Fourth": 1001,
  "Fragments": 1002,
  "Fredegar": 1003,
  "Free": 1004,
  "Friend": 1005,
  "Friends": 1006,
  "Friendship": 1007,
  "Frightening": 1008,
  "Frodo": 1009,
  "Frogmorton": 1010,
  "From": 1011,
  "Fruitless": 1012,
  "Frár": 1013,
  "Fréa": 1014,
  "Fréalaf": 1015,
  "Fréawine": 1016,
  "Fugitives": 1017,
  "Full": 1018,
  "Fundin": 1019,
  "Funny": 1020,
  "Fur": 1021,
  "Further": 1022,
  "Fury": 1023,
  "Fëanor": 1024,
  "G": 1025,
  "G3": 1026,
  "GOOD": 1027,
  "Gaffer": 1028,
  "Galadhon": 1029,
  "Galadhrim": 1030,
  "Galadriel": 1031,
  "Galathilion": 1032,
  "Galdor": 1033,
  "Galen": 1034,
  "Game": 1035,
  "Gamgee": 1036,
  "Gamgees": 1037,
  "Gamling": 1038,
  "Gandalf": 1039,
  "Gap": 1040,
  "Gardeners": 1041,
  "Gardens_": 1042,
  "Garn": 1043,
  "Gate": 1044,
  "Gates": 1045,
  "Gateway": 1046,
  "Gathering": 1047,
  "Gave": 1048,
  "Gebir": 1049,
  "Gel": 1050,
  "Gelin": 1051,
  "General": 1052,
  "Gently": 1053,
  "Gerontius": 1054,
  "Get": 1055,
  "Ghân": 1056,
  "Giants": 1057,
  "Gibbets": 1058,
  "Gil": 1059,
  "Gildor": 1060,
  "Gilrain": 1061,
  "Gilthoniel": 1062,
  "Gimli": 1063,
  "Give": 1064,
  "Given": 1065,
  "Giving": 1066,
  "Glad": 1067,
  "Gladden": 1068,
  "Glade": 1069,
  "Gladly": 1070,
  "Glamdring": 1071,
  "Gleams": 1072,
  "Glittering": 1073,
  "Gloom": 1074,
  "Glorfindel": 1075,
  "Gléowine": 1076,
  "Glóin": 1077,
  "Gnats": 1078,
  "Go": 1079,
  "Goatleaf": 1080,
  "Goes": 1081,
  "Going": 1082,
  "Golasgil": 1083,
  "Gold": 1084,
  "Goldberry": 1085,
  "Golden": 1086,
  "Goldenhaired": 1087,
  "Goldilocks": 1088,
  "Goldwine": 1089,
  "Gollum": 1090,
  "Gollums": 1091,
  "Gondolin": 1092,
  "Gondor": 1093,
  "Gondor_": 1094,
  "Gone": 1095,
  "Good": 1096,
  "Goodbodies": 1097,
  "Goodbody": 1098,
  "Goodbye": 1099,
  "Gorbadoc": 1100,
  "Gorbag": 1101,
  "Gore": 1102,
  "Gorgor": 1103,
  "Gorgoroth": 1104,
  "Gorhendad": 1105,
  "Got": 1106,
  "Gothmog": 1107,
  "Grabbing": 1108,
  "Gradually": 1109,
  "Gram": 1110,
  "Grand": 1111,
  "Grange": 1112,
  "Grappling": 1113,
  "Grave": 1114,
  "Great": 1115,
  "Greatly": 1116,
  "Greed": 1117,
  "Green": 1118,
  "Greenfields": 1119,
  "Greenleaf": 1120,
  "Greenway": 1121,
  "Greenwood": 1122,
  "Greetings": 1123,
  "Grey": 1124,
  "Greyflood": 1125,
  "Greyhame": 1126,
  "Grief": 1127,
  "Grieve": 1128,
  "Grievous": 1129,
  "Grim": 1130,
  "Grimbeorn": 1131,
  "Grimbold": 1132,
  "Grimslade": 1133,
  "Grip": 1134,
  "Gripping": 1135,
  "Grishnákh": 1136,
  "Grond": 1137,
  "Gross": 1138,
  "Growing": 1139,
  "Grown": 1140,
  "Grr": 1141,
  "Grrr": 1142,
  "Grubb": 1143,
  "Grubbs": 1144,
  "Gríma": 1145,
  "Guard": 1146,
  "Guarded": 1147,
  "Guardians": 1148,
  "Guards": 1149,
  "Guessing": 1150,
  "Guesthouse": 1151,
  "Guests": 1152,
  "Guided": 1153,
  "Guldur": 1154,
  "Gulf": 1155,
  "Gulls": 1156,
  "Gum": 1157,
  "Gurgling": 1158,
  "Guthláf": 1159,
  "Gwaihir": 1160,
  "Gálmód": 1161,
  "Gárulf": 1162,
  "Gúthwinë": 1163,
  "HOBBITON": 1164,
  "HUGO": 1165,
  "Ha": 1166,
  "Had": 1167,
  "Hadn": 1168,
  "Hador": 1169,
  "Hai": 1170,
  "Hail": 1171,
  "Hal": 1172,
  "Halbarad": 1173,
  "Haldir": 1174,
  "Half": 1175,
  "Halfast": 1176,
  "Halfelven": 1177,
  "Halfings": 1178,
  "Halfling": 1179,
  "Halflings": 1180,
  "Halifirien": 1181,
  "Hall": 1182,
  "Hallo": 1183,
  "Hallows": 1184,
  "Halt": 1185,
  "Ham": 1186,
  "Hamfast": 1187,
  "Hammer": 1188,
  "Hammerhand": 1189,
  "Hand": 1190,
  "Hang": 1191,
  "Happened": 1192,
  "Happily": 1193,
  "Happy": 1194,
  "Harad": 1195,
  "Haradrim": 1196,
  "Hard": 1197,
  "Hardbottle": 1198,
  "Hardening": 1199,
  "Hardest": 1200,
  "Harding": 1201,
  "Hardly": 1202,
  "Hardy": 1203,
  "Harfoot": 1204,
  "Harfoots": 1205,
  "Hark": 1206,
  "Harlond": 1207,
  "Harrowdale": 1208,
  "Harry": 1209,
  "Harsh": 1210,
  "Hart": 1211,
  "Harvest": 1212,
  "Has": 1213,
  "Hasn": 1214,
  "Haste": 1215,
  "Hasten": 1216,
  "Hastily": 1217,
  "Hasufel": 1218,
  "Hatred": 1219,
  "Haunted": 1220,
  "Have": 1221,
  "Haven": 1222,
  "Havens": 1223,
  "Having": 1224,
  "Hay": 1225,
  "Haysend": 1226,
  "Hayward": 1227,
  "He": 1228,
  "He_": 1229,
  "Heal": 1230,
  "Healer": 1231,
  "Healers": 1232,
  "Healing": 1233,
  "Health": 1234,
  "Hear": 1235,
  "Hearing": 1236,
  "Hearts": 1237,
  "Heather": 1238,
  "Heathertoes": 1239,
  "Heaving": 1240,
  "Heavy": 1241,
  "Hedge": 1242,
  "Hee": 1243,
  "Heed": 1244,
  "Heel": 1245,
  "Heir": 1246,
  "Helm": 1247,
  "Helmingas": 1248,
  "Helms": 1249,
  "Help": 1250,
  "Helps": 1251,
  "Hen": 1252,
  "Hence": 1253,
  "Henceforward": 1254,
  "Henneth": 1255,
  "Her": 1256,
  "Herbs": 1257,
  "Herdsmen": 1258,
  "Here": 1259,
  "Herefara": 1260,
  "Hero": 1261,
  "Herubrand": 1262,
  "Herugrim": 1263,
  "Hey": 1264,
  "Hi": 1265,
  "Hidden": 1266,
  "Hiding": 1267,
  "High": 1268,
  "Higher": 1269,
  "Hildinyar": 1270,
  "Hill": 1271,
  "Hills": 1272,
  "Him": 1273,
  "Himself": 1274,
  "Hinder": 1275,
  "Hirgon": 1276,
  "Hirluin": 1277,
  "His": 1278,
  "Hissed": 1279,
  "History": 1280,
  "Hither": 1281,
  "Hithoel": 1282,
  "Hm": 1283,
  "Hmm": 1284,
  "Ho": 1285,
  "Hoarwell": 1286,
  "Hob": 1287,
  "Hobbit": 1288,
  "Hobbit_": 1289,
  "Hobbiton": 1290,
  "Hobbitry": 1291,
  "Hobbits": 1292,
  "Hoisting": 1293,
  "Hola": 1294,
  "Holbytla": 1295,
  "Holbytlan": 1296,
  "Hold": 1297,
  "Holding": 1298,
  "Holdwine": 1299,
  "Hole": 1300,
  "Holes": 1301,
  "Hollen": 1302,
  "Hollin": 1303,
  "Holly": 1304,
  "Holman": 1305,
  "Home": 1306,
  "Homely": 1307,
  "Homeward": 1308,
  "Honestly": 1309,
  "Hoo": 1310,
  "Hoom": 1311,
  "Hoom_": 1312,
  "Hooray": 1313,
  "Hop": 1314,
  "Hope": 1315,
  "Hopes": 1316,
  "Horn": 1317,
  "Hornblower": 1318,
  "Hornblowers": 1319,
  "Hornburg": 1320,
  "Hornrock": 1321,
  "Horns": 1322,
  "Horse": 1323,
  "Horsemaster": 1324,
  "Horsemen": 1325,
  "Horses": 1326,
  "Host": 1327,
  "Hot": 1328,
  "Hound": 1329,
  "Hour": 1330,
  "Hours": 1331,
  "House": 1332,
  "Houses": 1333,
  "How": 1334,
  "Howe": 1335,
  "However": 1336,
  "Howling": 1337,
  "Hoy": 1338,
  "Hsh": 1339,
  "Huge": 1340,
  "Hugo": 1341,
  "Hullo": 1342,
  "Hundred": 1343,
  "Hundreds": 1344,
  "Hunger": 1345,
  "Hungry": 1346,
  "Hunt": 1347,
  "Hunter": 1348,
  "Hunters": 1349,
  "Hunting": 1350,
  "Huorn": 1351,
  "Huorns": 1352,
  "Hurrah": 1353,
  "Hurray": 1354,
  "Hurry": 1355,
  "Hurrying": 1356,
  "Hush": 1357,
  "Háma": 1358,
  "Húrin": 1359,
  "I": 1360,
  "II": 1361,
  "IV": 1362,
  "I_": 1363,
  "Iarwain": 1364,
  "Ice": 1365,
  "If": 1366,
  "Ill": 1367,
  "Ilmarin": 1368,
  "Imagine": 1369,
  "Imlad": 1370,
  "Imladris": 1371,
  "Imloth": 1372,
  "Immediately": 1373,
  "Immortal": 1374,
  "Imrahil": 1375,
  "In": 1376,
  "Incánus": 1377,
  "Indeed": 1378,
  "Inglorion": 1379,
  "Ingold": 1380,
  "Inland": 1381,
  "Inn": 1382,
  "Inside": 1383,
  "Instead": 1384,
  "Into": 1385,
  "Involuntarily": 1386,
  "Ioreth": 1387,
  "Iorlas": 1388,
  "Irensaga": 1389,
  "Iron": 1390,
  "Is": 1391,
  "Isen": 1392,
  "Isengard": 1393,
  "Isengarders": 1394,
  "Isengrim": 1395,
  "Isenmouthe": 1396,
  "Isildur": 1397,
  "Isle": 1398,
  "Isn": 1399,
  "It": 1400,
  "Ithil": 1401,
  "Ithilien": 1402,
  "Its": 1403,
  "Ivy": 1404,
  "January": 1405,
  "Jetsam": 1406,
  "Jewel": 1407,
  "Jolly": 1408,
  "Journey": 1409,
  "Joy": 1410,
  "July": 1411,
  "Jumped": 1412,
  "June": 1413,
  "Just": 1414,
  "Justice": 1415,
  "KING": 1416,
  "Keen": 1417,
  "Keep": 1418,
  "Keeping": 1419,
  "Key": 1420,
  "Keys": 1421,
  "Khand": 1422,
  "Khazad": 1423,
  "Khazâd": 1424,
  "Kheled": 1425,
  "Kibil": 1426,
  "Kill": 1427,
  "Kin": 1428,
  "Kindler": 1429,
  "Kindred": 1430,
  "Kindreds": 1431,
  "King": 1432,
  "Kingdom": 1433,
  "Kingdoms": 1434,
  "Kings": 1435,
  "Kingship": 1436,
  "Kinsman": 1437,
  "Knife": 1438,
  "Knobbed": 1439,
  "Knock": 1440,
  "Knocking": 1441,
  "Know": 1442,
  "Knowledge": 1443,
  "Known": 1444,
  "LOBELIA": 1445,
  "LONG": 1446,
  "LORD": 1447,
  "Labels": 1448,
  "Laboriously": 1449,
  "Ladies": 1450,
  "Lady": 1451,
  "Ladyship": 1452,
  "Lagduf": 1453,
  "Lair": 1454,
  "Lake": 1455,
  "Lamedon": 1456,
  "Lamps": 1457,
  "Lampwrights": 1458,
  "Land": 1459,
  "Landroval": 1460,
  "Lands": 1461,
  "Lane": 1462,
  "Langstrand": 1463,
  "Language": 1464,
  "Lanterns": 1465,
  "Lassemista": 1466,
  "Last": 1467,
  "Late": 1468,
  "Lately": 1469,
  "Later": 1470,
  "Laugh": 1471,
  "Laurelindórenan": 1472,
  "Lawks": 1473,
  "Lay": 1474,
  "Laying": 1475,
  "Lead": 1476,
  "Leader": 1477,
  "Leading": 1478,
  "Leaf": 1479,
  "Leaflock": 1480,
  "Leagues": 1481,
  "Lean": 1482,
  "Leaning": 1483,
  "Leap": 1484,
  "Leaping": 1485,
  "Learn": 1486,
  "Leastways": 1487,
  "Leave": 1488,
  "Leaves": 1489,
  "Leaving": 1490,
  "Lebennin": 1491,
  "Leg": 1492,
  "Legolas": 1493,
  "Lend": 1494,
  "Less": 1495,
  "Let": 1496,
  "Level": 1497,
  "Lhaw": 1498,
  "Lidless": 1499,
  "Lie": 1500,
  "Lieutenant": 1501,
  "Life": 1502,
  "Lifting": 1503,
  "Light": 1504,
  "Lightfoot": 1505,
  "Lightning": 1506,
  "Lights": 1507,
  "Like": 1508,
  "Limlight": 1509,
  "Lindir": 1510,
  "Linhir": 1511,
  "List": 1512,
  "Listen": 1513,
  "Listening": 1514,
  "Lithe": 1515,
  "Lithlad": 1516,
  "Lithui": 1517,
  "Little": 1518,
  "Live": 1519,
  "Living": 1520,
  "Lo": 1521,
  "Lobelia": 1522,
  "Lock": 1523,
  "Lockholes": 1524,
  "Log_": 1525,
  "Lone": 1526,
  "Lonely": 1527,
  "Long": 1528,
  "Longbottom": 1529,
  "Longer": 1530,
  "Longholes": 1531,
  "Longshanks": 1532,
  "Look": 1533,
  "Looking": 1534,
  "Loose": 1535,
  "Lor": 1536,
  "Lord": 1537,
  "Lordly": 1538,
  "Lords": 1539,
  "Lore": 1540,
  "Lorien": 1541,
  "Lose": 1542,
  "Lossarnach": 1543,
  "Lost": 1544,
  "Loth": 1545,
  "Lothlórien": 1546,
  "Lotho": 1547,
  "Lots": 1548,
  "Loud": 1549,
  "Loudly": 1550,
  "Loudwater": 1551,
  "Lovely": 1552,
  "Low": 1553,
  "Luck": 1554,
  "Luckily": 1555,
  "Lugbúrz": 1556,
  "Lugdush": 1557,
  "Luminous": 1558,
  "Lumpkin": 1559,
  "Lune": 1560,
  "Lurking": 1561,
  "Lying": 1562,
  "Léofa": 1563,
  "Lómëanor": 1564,
  "Lóni": 1565,
  "Lórien": 1566,
  "Lúthien": 1567,
  "MILO": 1568,
  "MORGUL_": 1569,
  "MORIA": 1570,
  "Mablung": 1571,
  "Mad": 1572,
  "Made": 1573,
  "Mae": 1574,
  "Maggot": 1575,
  "Maggots": 1576,
  "Magic": 1577,
  "Make": 1578,
  "Makes": 1579,
  "Making": 1580,
  "Malbeth": 1581,
  "Man": 1582,
  "Many": 1583,
  "Maps": 1584,
  "March": 1585,
  "Marches": 1586,
  "Marcho": 1587,
  "Mardil": 1588,
  "Marigold": 1589,
  "Marish": 1590,
  "Mark": 1591,
  "Marshal": 1592,
  "Marshes": 1593,
  "Masster": 1594,
  "Master": 1595,
  "Masters": 1596,
  "Mat": 1597,
  "Mathom": 1598,
  "Mauhúr": 1599,
  "May": 1600,
  "Maybe": 1601,
  "Mayhap": 1602,
  "Mayor": 1603,
  "Mazarbul": 1604,
  "Mazarbul_": 1605,
  "Me": 1606,
  "Mean": 1607,
  "Meaning": 1608,
  "Meanwhile": 1609,
  "Meddle": 1610,
  "Meduseld": 1611,
  "Meetings": 1612,
  "Melilot": 1613,
  "Melui": 1614,
  "Memory": 1615,
  "Men": 1616,
  "Meneldil": 1617,
  "Meneldor": 1618,
  "Menelvagor": 1619,
  "Mercy": 1620,
  "Mere": 1621,
  "Merely": 1622,
  "Merethrond": 1623,
  "Meriadoc": 1624,
  "Merry": 1625,
  "Messenger": 1626,
  "Messengers": 1627,
  "Methedras": 1628,
  "Michel": 1629,
  "Middle": 1630,
  "Midge": 1631,
  "Midgewater": 1632,
  "Midsummer": 1633,
  "Midyear": 1634,
  "Might": 1635,
  "Mighty": 1636,
  "Mill": 1637,
  "Miller": 1638,
  "Milo": 1639,
  "Min": 1640,
  "Minas": 1641,
  "Mind": 1642,
  "Mindolluin": 1643,
  "Mine": 1644,
  "Mines": 1645,
  "Mingled": 1646,
  "Minutes": 1647,
  "Mirkwood": 1648,
  "Mirror": 1649,
  "Mirrormere": 1650,
  "Miserable": 1651,
  "Misery": 1652,
  "Miss": 1653,
  "Mist": 1654,
  "Mister": 1655,
  "Mistress": 1656,
  "Mists": 1657,
  "Misty": 1658,
  "Mitheithel": 1659,
  "Mithlond": 1660,
  "Mithrandir": 1661,
  "Mithrandir_": 1662,
  "Mithril": 1663,
  "Monday": 1664,
  "Mondays": 1665,
  "Monoliths": 1666,
  "Monstrous": 1667,
  "Moon": 1668,
  "Moonset": 1669,
  "Moontower": 1670,
  "Moors": 1671,
  "Moot": 1672,
  "Morannon": 1673,
  "Mordor": 1674,
  "More": 1675,
  "Moreover": 1676,
  "Morgai": 1677,
  "Morgoth": 1678,
  "Morgul": 1679,
  "Morgulduin": 1680,
  "Moria": 1681,
  "Moria_": 1682,
  "Morning": 1683,
  "Morning_": 1684,
  "Mortal": 1685,
  "Mortals": 1686,
  "Morthond": 1687,
  "Most": 1688,
  "Mostly": 1689,
  "Mound": 1690,
  "Mounds": 1691,
  "Mount": 1692,
  "Mountain": 1693,
  "Mountains": 1694,
  "Mourn": 1695,
  "Mouth": 1696,
  "Moved": 1697,
  "Moving": 1698,
  "Mr": 1699,
  "Mrs": 1700,
  "Much": 1701,
  "Mugwort": 1702,
  "Mugworts": 1703,
  "Muil": 1704,
  "Mundburg": 1705,
  "Mushrooms": 1706,
  "Must": 1707,
  "Muster": 1708,
  "Mustn": 1709,
  "Muttering": 1710,
  "Muzgash": 1711,
  "My": 1712,
  "Myself": 1713,
  "Mûmak": 1714,
  "NO": 1715,
  "NOT": 1716,
  "NOW": 1717,
  "Na": 1718,
  "Nai": 1719,
  "Naith": 1720,
  "Naked": 1721,
  "Name": 1722,
  "Nameless": 1723,
  "Names": 1724,
  "Namárië": 1725,
  "Nan": 1726,
  "Nanduhirion": 1727,
  "Nar": 1728,
  "Narchost": 1729,
  "Nardol": 1730,
  "Nargothrond": 1731,
  "Narrow": 1732,
  "Narsil": 1733,
  "Narvi": 1734,
  "Narya": 1735,
  "Nassty": 1736,
  "Nasty": 1737,
  "Naught": 1738,
  "Naur": 1739,
  "Nay": 1740,
  "Nazgûl": 1741,
  "Nazgûl_": 1742,
  "Near": 1743,
  "Nearer": 1744,
  "Nearly": 1745,
  "Neat": 1746,
  "Neck": 1747,
  "Necromancer": 1748,
  "Need": 1749,
  "Needless": 1750,
  "Neekerbreekers": 1751,
  "Neither": 1752,
  "Neldoreth": 1753,
  "Nen": 1754,
  "Nenya": 1755,
  "Netted": 1756,
  "Never": 1757,
  "Nevertheless": 1758,
  "New": 1759,
  "News": 1760,
  "Next": 1761,
  "Nibs": 1762,
  "Nice": 1763,
  "Nick": 1764,
  "Night": 1765,
  "Nightingale": 1766,
  "Nimbrethil": 1767,
  "Nimloth": 1768,
  "Nimrais": 1769,
  "Nimrodel": 1770,
  "Nindalf": 1771,
  "Nine": 1772,
  "Nineteen": 1773,
  "Ninnyhammers": 1774,
  "No": 1775,
  "Noakes": 1776,
  "Nob": 1777,
  "Nobody": 1778,
  "Noises": 1779,
  "Noldor": 1780,
  "Noman": 1781,
  "None": 1782,
  "Nonetheless": 1783,
  "Nonsense": 1784,
  "Noodles": 1785,
  "Noon": 1786,
  "Nor": 1787,
  "Norbury": 1788,
  "Nori": 1789,
  "Norland": 1790,
  "North": 1791,
  "Northerland": 1792,
  "Northern": 1793,
  "Northerners": 1794,
  "Northfarthing": 1795,
  "Northlands": 1796,
  "Northmen": 1797,
  "Northward": 1798,
  "Nose": 1799,
  "Not": 1800,
  "Nothing": 1801,
  "November": 1802,
  "Now": 1803,
  "Nowhere": 1804,
  "Number": 1805,
  "Náli": 1806,
  "Númenor": 1807,
  "Númenorean": 1808,
  "Númenoreans": 1809,
  "Númenóreans": 1810,
  "Núrnen": 1811,
  "O": 1812,
  "OF": 1813,
  "ON": 1814,
  "OUR": 1815,
  "OWN": 1816,
  "Oakenshield": 1817,
  "Oathbreakers": 1818,
  "Oaths": 1819,
  "Obstinate": 1820,
  "Occasionally": 1821,
  "October": 1822,
  "Odd": 1823,
  "Odo": 1824,
  "Of": 1825,
  "Off": 1826,
  "Often": 1827,
  "Oh": 1828,
  "Oho": 1829,
  "Ohtar": 1830,
  "Oi": 1831,
  "Oiolossëo": 1832,
  "Old": 1833,
  "Oldbuck": 1834,
  "Oldbucks": 1835,
  "Oliphaunt": 1836,
  "Oliphaunts": 1837,
  "Olórin": 1838,
  "On": 1839,
  "On_": 1840,
  "Once": 1841,
  "One": 1842,
  "Ones": 1843,
  "Only": 1844,
  "Onodrim": 1845,
  "Open": 1846,
  "Opens": 1847,
  "Or": 1848,
  "Orald": 1849,
  "Orc": 1850,
  "Orcrist": 1851,
  "Orcs": 1852,
  "Orcses": 1853,
  "Order": 1854,
  "Orders": 1855,
  "Ori": 1856,
  "Orod": 1857,
  "Orodruin": 1858,
  "Orofarnë": 1859,
  "Oromë": 1860,
  "Orophin": 1861,
  "Orthanc": 1862,
  "Osgiliath": 1863,
  "Ossir": 1864,
  "Ossiriand": 1865,
  "Other": 1866,
  "Others": 1867,
  "Otherwise": 1868,
  "Otherworld": 1869,
  "Otho": 1870,
  "Ought": 1871,
  "Our": 1872,
  "Ours": 1873,
  "Out": 1874,
  "Outlands": 1875,
  "Outside": 1876,
  "Outsiders": 1877,
  "Over": 1878,
  "Overcome": 1879,
  "Overhead": 1880,
  "Overhill": 1881,
  "Overlord": 1882,
  "Ow": 1883,
  "PARTY": 1884,
  "PONY": 1885,
  "PRANCING": 1886,
  "PRESENT": 1887,
  "Pack": 1888,
  "Packs": 1889,
  "Paddle": 1890,
  "Pah": 1891,
  "Paladin": 1892,
  "Palantír": 1893,
  "Pale": 1894,
  "Paler": 1895,
  "Panting": 1896,
  "Part": 1897,
  "Parth": 1898,
  "Partings": 1899,
  "Partly": 1900,
  "Party": 1901,
  "Pass": 1902,
  "Passage": 1903,
  "Passing": 1904,
  "Past": 1905,
  "Paths": 1906,
  "Patience": 1907,
  "Patrol": 1908,
  "Paveyard": 1909,
  "Payment": 1910,
  "Peace": 1911,
  "Peak": 1912,
  "Peaks": 1913,
  "Peel": 1914,
  "Peering": 1915,
  "Pelargir": 1916,
  "Pelennor": 1917,
  "People": 1918,
  "Peoples": 1919,
  "Perch": 1920,
  "Perch_": 1921,
  "Perching": 1922,
  "Peregrin": 1923,
  "Perfect": 1924,
  "Perhaps": 1925,
  "Perian": 1926,
  "Periannath": 1927,
  "Peril": 1928,
  "Perilous": 1929,
  "Perilously": 1930,
  "Pheriain": 1931,
  "Pheriannath": 1932,
  "Pheriannath_": 1933,
  "Phew": 1934,
  "Phial": 1935,
  "Pick": 1936,
  "Picking": 1937,
  "Pickthorn": 1938,
  "Piles": 1939,
  "Pilgrim": 1940,
  "Pillars": 1941,
  "Pimple": 1942,
  "Pimply": 1943,
  "Pinnath": 1944,
  "Pip": 1945,
  "Pipe": 1946,
  "Pippin": 1947,
  "Pit": 1948,
  "Pits": 1949,
  "Pity": 1950,
  "Place": 1951,
  "Plague": 1952,
  "Plain": 1953,
  "Plainly": 1954,
  "Pleading": 1955,
  "Please": 1956,
  "Po": 1957,
  "Poison": 1958,
  "Ponies": 1959,
  "Pony": 1960,
  "Pony_": 1961,
  "Pony_he": 1962,
  "Pony_so": 1963,
  "Pool": 1964,
  "Poor": 1965,
  "Post": 1966,
  "Postmaster": 1967,
  "Power": 1968,
  "Practically": 1969,
  "Praise": 1970,
  "Praised": 1971,
  "Prancing": 1972,
  "Pray": 1973,
  "Precious": 1974,
  "Preciouss": 1975,
  "Presently": 1976,
  "Pretty": 1977,
  "Pride": 1978,
  "Primeroles": 1979,
  "Primula": 1980,
  "Prince": 1981,
  "Prisoner": 1982,
  "Probably": 1983,
  "Proud": 1984,
  "ProudFEET": 1985,
  "Proudfoot": 1986,
  "Proudfoots": 1987,
  "Prudence": 1988,
  "Ps": 1989,
  "Puddifoots": 1990,
  "Purpose": 1991,
  "Purposes": 1992,
  "Pursuers": 1993,
  "Pursuing": 1994,
  "Put": 1995,
  "Putting": 1996,
  "Pyre": 1997,
  "Púkel": 1998,
  "Qs": 1999,
  "Queen": 2000,
  "Queer": 2001,
  "Quest": 2002,
  "Questioner": 2003,
  "Quick": 2004,
  "Quickbeam": 2005,
  "Quicker": 2006,
  "Quickly": 2007,
  "Quietly": 2008,
  "Quite": 2009,
  "R": 2010,
  "RAF": 2011,
  "RETURN": 2012,
  "RINGS": 2013,
  "ROAD": 2014,
  "Rabbit": 2015,
  "Race": 2016,
  "Radagast": 2017,
  "Radbug": 2018,
  "Rage": 2019,
  "Ragged": 2020,
  "Rain": 2021,
  "Raise": 2022,
  "Raising": 2023,
  "Rammas": 2024,
  "Rams": 2025,
  "Ranger": 2026,
  "Rangers": 2027,
  "Rapids": 2028,
  "Rath": 2029,
  "Rather": 2030,
  "Rauros": 2031,
  "Ready": 2032,
  "Real": 2033,
  "Really": 2034,
  "Realm": 2035,
  "Reasons": 2036,
  "Receive": 2037,
  "Recently": 2038,
  "Reckless": 2039,
  "Records": 2040,
  "Red": 2041,
  "Rede": 2042,
  "Redhorn": 2043,
  "Reeds": 2044,
  "Reforged": 2045,
  "Refuse": 2046,
  "Regiments": 2047,
  "Reluctantly": 2048,
  "Remember": 2049,
  "Remmirath": 2050,
  "Remnants": 2051,
  "Removed": 2052,
  "Renewed": 2053,
  "Renewer": 2054,
  "Renowned": 2055,
  "Rest": 2056,
  "Return": 2057,
  "Returns": 2058,
  "Reunited": 2059,
  "Revenge": 2060,
  "Rewards": 2061,
  "Rhosgobel": 2062,
  "Rhymes": 2063,
  "Rhûn": 2064,
  "Rich": 2065,
  "Riddermark": 2066,
  "Riddle": 2067,
  "Ride": 2068,
  "Rider": 2069,
  "Riders": 2070,
  "Riding": 2071,
  "Right": 2072,
  "Rightly": 2073,
  "Rills": 2074,
  "Rimmon": 2075,
  "Ring": 2076,
  "Ringlord": 2077,
  "Ringló": 2078,
  "Rings": 2079,
  "Ringwraith": 2080,
  "Ringwraiths": 2081,
  "Rise": 2082,
  "Rising": 2083,
  "Rivendell": 2084,
  "River": 2085,
  "Rivers": 2086,
  "Road": 2087,
  "Robin": 2088,
  "Rock": 2089,
  "Rohan": 2090,
  "Roheryn": 2091,
  "Rohirrim": 2092,
  "Roll": 2093,
  "Room": 2094,
  "Root": 2095,
  "Rope": 2096,
  "Ropes": 2097,
  "Rory": 2098,
  "Rose": 2099,
  "Rosie": 2100,
  "Rough": 2101,
  "Round": 2102,
  "Rounding": 2103,
  "Rousing": 2104,
  "Rover": 2105,
  "Row": 2106,
  "Row_": 2107,
  "Rowan": 2108,
  "Rowlie": 2109,
  "Ruffians": 2110,
  "Rule": 2111,
  "Ruler": 2112,
  "Rulers": 2113,
  "Rules": 2114,
  "Rules_": 2115,
  "Ruling": 2116,
  "Rumble": 2117,
  "Rumours": 2118,
  "Run": 2119,
  "Runes": 2120,
  "Running": 2121,
  "Rushey": 2122,
  "Rushlight": 2123,
  "Rómello": 2124,
  "Rúmil": 2125,
  "S": 2126,
  "SACKVILLE": 2127,
  "SECOND": 2128,
  "SHIRE": 2129,
  "SON": 2130,
  "Sackville": 2131,
  "Sad": 2132,
  "Saddle": 2133,
  "Safe": 2134,
  "Safely": 2135,
  "Safer": 2136,
  "Safest": 2137,
  "Said": 2138,
  "Sam": 2139,
  "Sam_": 2140,
  "Same": 2141,
  "Sammath": 2142,
  "Sammie": 2143,
  "Samwise": 2144,
  "Sancho": 2145,
  "Sand": 2146,
  "Sandheaver": 2147,
  "Sandyman": 2148,
  "Saradoc": 2149,
  "Sarn": 2150,
  "Saruman": 2151,
  "Satisfied": 2152,
  "Saturday": 2153,
  "Sauron": 2154,
  "Save": 2155,
  "Say": 2156,
  "Says": 2157,
  "Scaring": 2158,
  "Scary": 2159,
  "Scatha": 2160,
  "Scouring": 2161,
  "Scouts": 2162,
  "Sea": 2163,
  "Search": 2164,
  "Searing": 2165,
  "Seas": 2166,
  "Seat": 2167,
  "Second": 2168,
  "Secret": 2169,
  "Securely": 2170,
  "See": 2171,
  "Seeing": 2172,
  "Seek": 2173,
  "Seeking": 2174,
  "Seems": 2175,
  "Seen": 2176,
  "Seer": 2177,
  "Seizing": 2178,
  "Seldom": 2179,
  "Send": 2180,
  "Senses": 2181,
  "September": 2182,
  "Seriously": 2183,
  "Service": 2184,
  "Setting": 2185,
  "Settle": 2186,
  "Seven": 2187,
  "Seventh": 2188,
  "Several": 2189,
  "Sh": 2190,
  "Shadow": 2191,
  "Shadowfax": 2192,
  "Shadowmere": 2193,
  "Shadows": 2194,
  "Shadowy": 2195,
  "Shafts": 2196,
  "Shagrat": 2197,
  "Shall": 2198,
  "Shapeless": 2199,
  "Sharing": 2200,
  "Sharkey": 2201,
  "Sharp": 2202,
  "Sharpen": 2203,
  "Shathûr": 2204,
  "She": 2205,
  "Sheep": 2206,
  "Sheer": 2207,
  "Shelf": 2208,
  "Shelob": 2209,
  "Shelter": 2210,
  "Ship": 2211,
  "Ships": 2212,
  "Shipwright": 2213,
  "Shire": 2214,
  "Shire_": 2215,
  "Shirefolk": 2216,
  "Shirelike": 2217,
  "Shiretalk_": 2218,
  "Shirriff": 2219,
  "Shirriffing": 2220,
  "Shirriffs": 2221,
  "Shoot": 2222,
  "Shore": 2223,
  "Shores": 2224,
  "Short": 2225,
  "Shortly": 2226,
  "Shot": 2227,
  "Should": 2228,
  "Show": 2229,
  "Shreds": 2230,
  "Shriekers": 2231,
  "Shrill": 2232,
  "Shrivel": 2233,
  "Shut": 2234,
  "Si": 2235,
  "Sickle": 2236,
  "Side": 2237,
  "Siege": 2238,
  "Sight": 2239,
  "Sign": 2240,
  "Signal": 2241,
  "Signs": 2242,
  "Silence": 2243,
  "Silent": 2244,
  "Silly": 2245,
  "Silmaril": 2246,
  "Silmarils": 2247,
  "Silvan": 2248,
  "Silver": 2249,
  "Silverlode": 2250,
  "Silverlode_": 2251,
  "Silvertine": 2252,
  "Simple": 2253,
  "Simply": 2254,
  "Since": 2255,
  "Sing": 2256,
  "Singing": 2257,
  "Sinome": 2258,
  "Sir": 2259,
  "Sirannon": 2260,
  "Sit": 2261,
  "Sitting": 2262,
  "Six": 2263,
  "Sixty": 2264,
  "Skinbark": 2265,
  "Skirting": 2266,
  "Sky": 2267,
  "Slain": 2268,
  "Slam": 2269,
  "Slanting": 2270,
  "Slay": 2271,
  "Sleep": 2272,
  "Sleepily": 2273,
  "Sleepiness": 2274,
  "Sleeping": 2275,
  "Sleepless": 2276,
  "Sleepy": 2277,
  "Slender": 2278,
  "Slinging": 2279,
  "Slinker": 2280,
  "Slow": 2281,
  "Slowly": 2282,
  "Sluggard": 2283,
  "Small": 2284,
  "Smallburrow": 2285,
  "Smaug": 2286,
  "Smials": 2287,
  "Smials_": 2288,
  "Smiths": 2289,
  "Smoke": 2290,
  "Smokes": 2291,
  "Smoking": 2292,
  "Sméagol": 2293,
  "Sméagol_": 2294,
  "Snaga": 2295,
  "Snakes": 2296,
  "Snatches": 2297,
  "Sneak": 2298,
  "Sneaking": 2299,
  "Snow": 2300,
  "Snowbourn": 2301,
  "Snowmane": 2302,
  "So": 2303,
  "Sobs": 2304,
  "Soft": 2305,
  "Softly": 2306,
  "Solemnly": 2307,
  "Some": 2308,
  "Somehow": 2309,
  "Someone": 2310,
  "Something": 2311,
  "Sometimes": 2312,
  "Somewhere": 2313,
  "Songs": 2314,
  "Sons": 2315,
  "Soon": 2316,
  "Sorcerer": 2317,
  "Sorceress": 2318,
  "Sorcery": 2319,
  "Sorrow": 2320,
  "Sorrowfully": 2321,
  "Sorry": 2322,
  "Sounds": 2323,
  "South": 2324,
  "Southern": 2325,
  "Southerner": 2326,
  "Southerners": 2327,
  "Southfarthing": 2328,
  "Southlands": 2329,
  "Southlinch": 2330,
  "Southron": 2331,
  "Southrons": 2332,
  "Southward": 2333,
  "Southwards": 2334,
  "Spare": 2335,
  "Speak": 2336,
  "Spear": 2337,
  "Speech": 2338,
  "Speed": 2339,
  "Spies": 2340,
  "Splendid": 2341,
  "Spluttering": 2342,
  "Spoil": 2343,
  "Spoiling": 2344,
  "Spoons": 2345,
  "Spring": 2346,
  "Springle": 2347,
  "Sss": 2348,
  "Sssh": 2349,
  "Ssss": 2350,
  "Stabbed": 2351,
  "Staddle": 2352,
  "Stair": 2353,
  "Stairs": 2354,
  "Stairs_": 2355,
  "Stand": 2356,
  "Standing": 2357,
  "Star": 2358,
  "Starkhorn": 2359,
  "Stars": 2360,
  "Stay": 2361,
  "Steady": 2362,
  "Steeds": 2363,
  "Steel": 2364,
  "Steep": 2365,
  "Step": 2366,
  "Steps": 2367,
  "Stern": 2368,
  "Stew": 2369,
  "Steward": 2370,
  "Stewards": 2371,
  "Stewardship": 2372,
  "Stewed": 2373,
  "Stick": 2374,
  "Still": 2375,
  "Sting": 2376,
  "Stinker": 2377,
  "Stir": 2378,
  "Stock": 2379,
  "Stone": 2380,
  "Stonebows": 2381,
  "Stonehouse": 2382,
  "Stones": 2383,
  "Stonewain": 2384,
  "Stoningland": 2385,
  "Stony": 2386,
  "Stooping": 2387,
  "Stoors": 2388,
  "Stop": 2389,
  "Storage": 2390,
  "Store": 2391,
  "Storm": 2392,
  "Stormcrow": 2393,
  "Story": 2394,
  "Stout": 2395,
  "Straight": 2396,
  "Strange": 2397,
  "Strangely": 2398,
  "Strawheads": 2399,
  "Stray": 2400,
  "Street": 2401,
  "Strider": 2402,
  "Strike": 2403,
  "Stringing": 2404,
  "Stripped": 2405,
  "Stroke": 2406,
  "Strong": 2407,
  "Stronger": 2408,
  "Stumps": 2409,
  "Stybba": 2410,
  "Such": 2411,
  "Suddenly": 2412,
  "Summer": 2413,
  "Sun": 2414,
  "Sunday": 2415,
  "Sundering": 2416,
  "Sunlands": 2417,
  "Sunlending": 2418,
  "Sunless": 2419,
  "Sunlight": 2420,
  "Sunset": 2421,
  "Supper": 2422,
  "Supposing": 2423,
  "Surely": 2424,
  "Surety": 2425,
  "Suspicion": 2426,
  "Swagger": 2427,
  "Swan": 2428,
  "Swanfleet": 2429,
  "Swans": 2430,
  "Swarthy": 2431,
  "Swear": 2432,
  "Sweet": 2433,
  "Swertings": 2434,
  "Swift": 2435,
  "Swiftly": 2436,
  "Swish": 2437,
  "Sword": 2438,
  "Swords": 2439,
  "Swordsman": 2440,
  "Séa": 2441,
  "Sí": 2442,
  "Sûl": 2443,
  "THE": 2444,
  "TOOK": 2445,
  "TOWERS_": 2446,
  "TWO": 2447,
  "Take": 2448,
  "Taken": 2449,
  "Taking": 2450,
  "Tale": 2451,
  "Tales": 2452,
  "Talking": 2453,
  "Tall": 2454,
  "Taller": 2455,
  "Taming": 2456,
  "Targon": 2457,
  "Tarlang": 2458,
  "Tarmenel": 2459,
  "Tarry": 2460,
  "Tasarinan": 2461,
  "Taur": 2462,
  "Taurelilómëa": 2463,
  "Tauremorna": 2464,
  "Tauremornalómë": 2465,
  "Tearing": 2466,
  "Tears": 2467,
  "Ted": 2468,
  "Teeth": 2469,
  "Telchar": 2470,
  "Tell": 2471,
  "Telperion": 2472,
  "Ten": 2473,
  "Terrified": 2474,
  "Terror": 2475,
  "Thain": 2476,
  "Thainship": 2477,
  "Thangorodrim": 2478,
  "Thank": 2479,
  "Thanks": 2480,
  "Tharbad": 2481,
  "Tharkûn": 2482,
  "That": 2483,
  "The": 2484,
  "Their": 2485,
  "Then": 2486,
  "Thence": 2487,
  "Thengel": 2488,
  "Thengling": 2489,
  "There": 2490,
  "Therefore": 2491,
  "Therein": 2492,
  "Thereupon": 2493,
  "These": 2494,
  "They": 2495,
  "Thief": 2496,
  "Thieves": 2497,
  "Thin": 2498,
  "Thinbone": 2499,
  "Thing": 2500,
  "Thingol": 2501,
  "Things": 2502,
  "Think": 2503,
  "Thinking": 2504,
  "Third": 2505,
  "Thirteen": 2506,
  "Thirty": 2507,
  "This": 2508,
  "Thistlewool": 2509,
  "Thither": 2510,
  "Thorin": 2511,
  "Thornbushes": 2512,
  "Thorondor": 2513,
  "Those": 2514,
  "Thou": 2515,
  "Though": 2516,
  "Thought": 2517,
  "Thousands": 2518,
  "Thranduil": 2519,
  "Three": 2520,
  "Thrice": 2521,
  "Thrihyrne": 2522,
  "Throne": 2523,
  "Throttle": 2524,
  "Through": 2525,
  "Throughout": 2526,
  "Throw": 2527,
  "Throwing": 2528,
  "Thráin": 2529,
  "Thrór": 2530,
  "Thunder": 2531,
  "Thursday": 2532,
  "Thus": 2533,
  "Thy": 2534,
  "Théoden": 2535,
  "Théodred": 2536,
  "Thôn": 2537,
  "Tidings": 2538,
  "Tie": 2539,
  "Tighfield": 2540,
  "Till": 2541,
  "Tim": 2542,
  "Time": 2543,
  "Tinbone": 2544,
  "Tindrock": 2545,
  "Tintallë": 2546,
  "Tinúviel": 2547,
  "Tired": 2548,
  "Tirelessly": 2549,
  "Tirion": 2550,
  "Tirith": 2551,
  "Tirith_": 2552,
  "Tis": 2553,
  "To": 2554,
  "Tobold": 2555,
  "Toby": 2556,
  "Today": 2557,
  "Together": 2558,
  "Tol": 2559,
  "Tom": 2560,
  "Tombs": 2561,
  "Tomorrow": 2562,
  "Tongue": 2563,
  "Tongues": 2564,
  "Tonight": 2565,
  "Too": 2566,
  "Took": 2567,
  "Tookland": 2568,
  "Tooks": 2569,
  "Top": 2570,
  "Torches": 2571,
  "Torech": 2572,
  "Torment": 2573,
  "Touched": 2574,
  "Towards": 2575,
  "Tower": 2576,
  "Towers": 2577,
  "Town": 2578,
  "Tramping": 2579,
  "Translations": 2580,
  "Trapped": 2581,
  "Travellers": 2582,
  "Treachery": 2583,
  "Tread": 2584,
  "Treasure": 2585,
  "Treat": 2586,
  "Tree": 2587,
  "Treebeard": 2588,
  "Treegarth": 2589,
  "Trees": 2590,
  "Trembling": 2591,
  "Tremendous": 2592,
  "Trespassing": 2593,
  "Tricksy": 2594,
  "Tried": 2595,
  "Troll": 2596,
  "Trolls": 2597,
  "Troop": 2598,
  "Troubles": 2599,
  "Trover": 2600,
  "True": 2601,
  "Truly": 2602,
  "Trumpets": 2603,
  "Trust": 2604,
  "Try": 2605,
  "Trying": 2606,
  "Tuckborough": 2607,
  "Tugging": 2608,
  "Tumbaletaurëa": 2609,
  "Tumladen": 2610,
  "Tunnelly": 2611,
  "Turn": 2612,
  "Turning": 2613,
  "Twas": 2614,
  "Twelfth": 2615,
  "Twelve": 2616,
  "Twenty": 2617,
  "Twice": 2618,
  "Twilight": 2619,
  "Twill": 2620,
  "Twisted": 2621,
  "Twitching": 2622,
  "Two": 2623,
  "Twofoot": 2624,
  "Túrin": 2625,
  "Udûn": 2626,
  "Ufthak": 2627,
  "Ugh": 2628,
  "Uglúk": 2629,
  "Umbar": 2630,
  "Unbelievable": 2631,
  "Uncanny": 2632,
  "Uncle": 2633,
  "Under": 2634,
  "Undergate": 2635,
  "Underharrow": 2636,
  "Underhill": 2637,
  "Underhills": 2638,
  "Understand": 2639,
  "Undertowers": 2640,
  "Underworld": 2641,
  "Undimmed": 2642,
  "Undómiel": 2643,
  "Unearthly": 2644,
  "Unescapable": 2645,
  "Unexpected": 2646,
  "Unfortunately": 2647,
  "Ungol": 2648,
  "Ungoliant": 2649,
  "Unhappy": 2650,
  "Unheeding": 2651,
  "Unless": 2652,
  "Unlooked": 2653,
  "Unloose": 2654,
  "Unmarred": 2655,
  "Unmasked": 2656,
  "Unnamed": 2657,
  "Unnoticed": 2658,
  "Unsay": 2659,
  "Unseen": 2660,
  "Untidy": 2661,
  "Untie": 2662,
  "Until": 2663,
  "Unwearied": 2664,
  "Up": 2665,
  "Upbourn": 2666,
  "Upon": 2667,
  "Upwards": 2668,
  "Uruk": 2669,
  "Uruks": 2670,
  "Use": 2671,
  "Uttermost": 2672,
  "V": 2673,
  "VERY": 2674,
  "Vain": 2675,
  "Vainly": 2676,
  "Valandil": 2677,
  "Valar": 2678,
  "Vale": 2679,
  "Valimar": 2680,
  "Valinor": 2681,
  "Valinorean": 2682,
  "Valley": 2683,
  "Valour": 2684,
  "Vanish": 2685,
  "Vanity": 2686,
  "Varda": 2687,
  "Vardo": 2688,
  "Variags": 2689,
  "Various": 2690,
  "Venerable": 2691,
  "Verily": 2692,
  "Very": 2693,
  "Victory": 2694,
  "Vilya": 2695,
  "Visible": 2696,
  "Vividly": 2697,
  "Voice": 2698,
  "Voices": 2699,
  "Vorondil": 2700,
  "Vulgar": 2701,
  "Wailing": 2702,
  "Wait": 2703,
  "Waiting": 2704,
  "Wake": 2705,
  "Walda": 2706,
  "Walk": 2707,
  "Walkers": 2708,
  "Walking": 2709,
  "Wall": 2710,
  "Walls": 2711,
  "Wanderer": 2712,
  "Wanderers": 2713,
  "Wandering": 2714,
  "Wandlimb": 2715,
  "War": 2716,
  "Warden": 2717,
  "Wardens": 2718,
  "Ware": 2719,
  "Wargs": 2720,
  "Warily": 2721,
  "Warm": 2722,
  "Warn": 2723,
  "Warning": 2724,
  "Wars": 2725,
  "Was": 2726,
  "Wasn": 2727,
  "Waste": 2728,
  "Wasted": 2729,
  "Watch": 2730,
  "Watcher": 2731,
  "Watchers": 2732,
  "Watchmen": 2733,
  "Watchwood": 2734,
  "Water": 2735,
  "Way": 2736,
  "Waymeet": 2737,
  "We": 2738,
  "Weapons": 2739,
  "Wearily": 2740,
  "Weariness": 2741,
  "Weary": 2742,
  "Weathertop": 2743,
  "Wednesday": 2744,
  "Weeks": 2745,
  "Welcome": 2746,
  "Well": 2747,
  "Wellinghall": 2748,
  "Went": 2749,
  "Were": 2750,
  "West": 2751,
  "Westemnet": 2752,
  "Western": 2753,
  "Westernesse": 2754,
  "Westfarthing": 2755,
  "Westfold": 2756,
  "Westfolders": 2757,
  "Westgate": 2758,
  "Westmarch": 2759,
  "Westron": 2760,
  "Westward": 2761,
  "Wetwang": 2762,
  "What": 2763,
  "Whatever": 2764,
  "Wheew": 2765,
  "When": 2766,
  "Whence": 2767,
  "Whenever": 2768,
  "Where": 2769,
  "Whereas": 2770,
  "Wherever": 2771,
  "Whether": 2772,
  "Whew": 2773,
  "Which": 2774,
  "While": 2775,
  "Whips": 2776,
  "Whispering": 2777,
  "White": 2778,
  "Whiteskins": 2779,
  "Whitfoot": 2780,
  "Whitfurrows": 2781,
  "Whither": 2782,
  "Whitwell": 2783,
  "Who": 2784,
  "Whoa": 2785,
  "Whoever": 2786,
  "Wholesome": 2787,
  "Whom": 2788,
  "Whose": 2789,
  "Why": 2790,
  "Wicked": 2791,
  "Wide": 2792,
  "Widow": 2793,
  "Wielding": 2794,
  "Wight": 2795,
  "Wights": 2796,
  "Wild": 2797,
  "Wilderland": 2798,
  "Wilderness": 2799,
  "Will": 2800,
  "Willie": 2801,
  "Willow": 2802,
  "Wind": 2803,
  "Windfola": 2804,
  "Winding": 2805,
  "Windlord": 2806,
  "Window": 2807,
  "Winged": 2808,
  "Wingfoot": 2809,
  "Winging": 2810,
  "Wings": 2811,
  "Winter": 2812,
  "Winyards": 2813,
  "Wise": 2814,
  "Wiser": 2815,
